Repository: vim-doc-es/vimdocs
Catalog: 7.3/recursos_de_traduccion/doc-compendium.tmx
Source language: en
Languages: es_es

source: The <BS> key was already mentioned.
es_es: La tecla <BS> ya se ha mencionado.

source: It deletes the character just before the cursor.
es_es: Borra el carácter que precede al cursor.

source: The <Del> key does the same for the character under (after) the cursor.
es_es: La tecla <Del> hace lo mismo con el carácter debajo (después) del cursor.

source: When you typed a whole word wrong, use CTRL-W:
es_es: Use CTRL-W en caso de haber tecleado una palabra completamente errónea:

source: If you really messed up a line and want to start over, use CTRL-U to delete it.
es_es: En caso de haber realizado errores en una línea, y desea empezar otra vez, use CTRL-U para eliminarlo.

source: This keeps the text after the cursor and the indent.
es_es: Esto mantiene el texto después del cursor, así como la tabulación.

source: Only the text from the first non-blank to the cursor is deleted.
es_es: Sólo se elimina el texto desde el primer espacio que no esté vacío hasta el cursor.

source: With the cursor on the "f" of "fallen" in the next line pressing CTRL-U does this:
es_es: Pulsar CTRL-U con el cursor sobre la «c» de «cayó» hace lo siguiente:

source: When you spot a mistake a few words back, you need to move the cursor there to correct it.
es_es: Cuando detecta un error en alguna palabra anterior, necesita desplazar el cursor hasta ese punto para corregirlo.

source: For example, you typed this:
es_es: Por ejemplo, escribió lo siguiente:

source: You need to change "follen" to "fallen".
es_es: Necesita cambiar «cayo» a «cayó».

source: With the cursor at the end, you would type this to correct it: >
es_es: Con el cursor al final, teclearía esto para corregirlo: >

source: This uses special keys to move around, while remaining in Insert mode.
es_es: Esto emplea teclas especiales para el desplazamiento, a la vez que permanece en el modo Insertar.

source: This resembles what you would do in a modeless editor.
es_es: Esto se parece a lo que haría con un editor sin modos.

source: It's easier to remember, but takes more time (you have to move your hand from the letters to the cursor keys, and the <End> key is hard to press without looking at the keyboard).
es_es: Es más fácil de recordar, pero lleva más tiempo (tiene que mover sus manos de las letras a las teclas del cursor, y es difícil pulsar la tecla <Fin> sin mirar el teclado).

source: These special keys are most useful when writing a mapping that doesn't leave Insert mode.
es_es: Estas teclas especiales son más útiles cuando escribe una macro que no abandona el modo Insertar.

source: The extra typing doesn't matter then.
es_es: El tecleo adicional no importa en este caso.

source: An overview of the keys you can use in Insert mode:
es_es: Este es un resumen de las teclas que puede usar en el modo Insertar:

source: When you type a ) it would be nice to see with which ( it matches.
es_es: Al teclear una «)» estaría bien ver con qué «(» encaja.

source: To make Vim do that use this command: >
es_es: Para hacer que Vim use esta orden: >

source: When you now type a text like "(example)", as soon as you type the ) Vim will briefly move the cursor to the matching (, keep it there for half a second, and move back to where you were typing.
es_es: Ahora, cuando teclee un texto como «(ejemplo), tan pronto como teclee el «)» Vim moverá el cursor brevemente al «(» correspondiente, lo mantendrá ahí medio segundo, y volverá a donde estaba tecleando.

source: In case there is no matching (, Vim will beep.
es_es: En caso de no existir un correspondiente «(», Vim pitará.

source: Then you know that you might have forgotten the ( somewhere, or typed a ) too many.
es_es: Sabrá entonces que ha olvidado el «(» en algún lugar, o que escribió una «)» demasiadas veces.

source: The match will also be shown for [] and {} pairs.
es_es: También se mostrará el signo correspondiente en las parejas «[]» «{}».

source: You don't have to wait with typing the next character, as soon as Vim sees it the cursor will move back and inserting continues as before.
es_es: No tiene que esperar a teclear el siguiente carácter, ya que tan pronto como Vim lo detecte, devolverá el cursor a su posición original, continuando la inserción.

source: You can change the time Vim waits with the 'matchtime' option.
es_es: Puede modificar el tiempo que Vim espera con la opción 'matchtime'.

source: For example, to make Vim wait one and a half second: >
es_es: Por ejemplo, para hacer que Vim espere un segundo y medio: >

source: Vim can automatically complete words on insertion.
es_es: Vim puede auto-completar palabras durante la inserción.

source: You type the first part of a word, press CTRL-P, and Vim guesses the rest.
es_es: Escriba primero la parte inicial de una palabra, pulse CTRL-P y Vim adivinará el resto.

source: Suppose, for example, that you are creating a C program and want to type in the following:
es_es: Suponga, por ejemplo, que está creando un programa en C y que desea teclear lo siguiente:

source: At this point, you tell Vim to complete the word using the command CTRL-P.
es_es: En este punto es cuando le dice a Vim que complete la palabra usando la orden CTRL-P.

source: Vim searches for a word that starts with what's in front of the cursor.
es_es: Vim buscará una palabra que empiece con lo que se aparece frente al cursor.

source: In this case, it is "ch_", which matches with the word ch_array.
es_es: En este caso, es «ch_», el cual encaja con la palabra «ch_array».

source: So typing CTRL-P gives you the following:
es_es: Por ello, teclear CTRL-P le daría lo siguiente:

source: If you now type CTRL-P Vim will search again for a word that completes the word before the cursor.
es_es: Si pulsa ahora CTRL-P, Vim buscará otra vez una palabra que complete la que se haya frente al cursor.

source: Since there is nothing in front of the cursor, it finds the first word backwards, which is "ch_array".
es_es: Ya que no hay nada en frente del cursor, busca la palabra en sentido inverso, el cual es «ch_array».

source: Typing CTRL-P again gives you the next word that matches, in this case "total".
es_es: Pulsar CTRL-P otra vez le daría la siguiente palabra que encaja, en este caso «total».

source: A third CTRL-P searches further back.
es_es: Si lo pulsa por tercera vez, Vim buscará aún más atrás.

source: If there is nothing else, it causes the editor to run out of words, so it returns to the original text, which is nothing.
es_es: Si no hay nada más, al editor se le acabarían las palabras, volviendo al texto original, que es nada.

source: A fourth CTRL-P causes the editor to start over again with "ch_array".
es_es: Un cuarto CTRL-P causaría al editor empezar otra vez con «ch_array».

source: To search forward, use CTRL-N.
es_es: Use CTRL-N para una búsqueda hacia delante.

source: Since the search wraps around the end of the file, CTRL-N and CTRL-P will find the same matches, but in a different sequence.
es_es: Ya que la búsqueda vuelve al inicio cuando llega al final del archivo, CTRL-N y CTRL-P encontrarán las mismas coincidencias, pero en distinto orden.

source: Hint: CTRL-N is Next-match and CTRL-P is Previous-match.
es_es: Pista: CTRL-N es siguiente coincidencia («Next-match») y CTRL-P es la coincidencia anterior («Previous-match»).

source: The Vim editor goes through a lot of effort to find words to complete.
es_es: Vim realiza un gran esfuerzo por encontrar palabras que completar.

source: By default, it searches the following places:
es_es: Por omisión, busca en los siguientes lugares:

source: Current file 2.
es_es: Archivo actual 2.

source: Files in other windows 3.
es_es: Archivos en otras ventanas 3.

source: Other loaded files (hidden buffers) 4.
es_es: Otros archivos cargados (búfers ocultos) 4.

source: Files which are not loaded (inactive buffers) 5.
es_es: Archivos que no están cargados (búfers inactivos) 5.

source: Tag files 6.
es_es: Archivos de etiquetas 6.

source: All files #included by the current file
es_es: Todos los archivos #incluidos en el archivo actual

source: The 'ignorecase' option is used.
es_es: La opción 'ignorecase' es empleada.

source: When it is set, case differences are ignored when searching for matches.
es_es: Las diferencias entre mayúsculas y minúsculas se ignorarán al buscar coincidencias de activar esta opción.

source: A special option for completion is 'infercase'.
es_es: 'infercase' es una opción especial para el autocompletado.

source: This is useful to find matches while ignoring case ('ignorecase' must be set) but still using the case of the word typed so far.
es_es: Es útil para encontrar parejas cuando ignora la sensibilidad a mayúsculas y minúsculas (debe activar 'ignorecase') , y seguir usando con esta palabra la mencionada sensibilidad.

source: Thus if you type "For" and Vim finds a match "fortunately", it will result in "Fortunately".
es_es: Por ello, si teclea «Para» y Vim encuentra «paramilitar», el resultado final será «Paramilitar».

source: After each of them CTRL-N can be used to find the next match, CTRL-P to find the previous match.
es_es: Puede usar CTRL-N después de cada uno de estas órdenes para hallar la siguiente coincidencia, y CTRL-P para hallar la anterior.

source: More information for each of these commands here: |ins-completion|.
es_es: Para más información acerca de estas órdenes, consulte |ins-completion|.

source: Let's take CTRL-X CTRL-F as an example.
es_es: Tomemos CTRL-X CTRL-F como ejemplo.

source: This will find file names.
es_es: Esto busca nombres de archivo.

source: It scans the current directory for files and displays each one that matches the word in front of the cursor.
es_es: Examina el directorio actual en busca de archivos, y muestra cada uno que encaja con la palabra frenet al cursor.

source: Suppose, for example, that you have the following files in the current directory:
es_es: Suponga, por ejemplo, que tiene las siguientes líneas en el directorio actual:

source: At this point, you enter the command CTRL-X CTRL-F.
es_es: En este momento, introduzca la orden CTRL-X CTRL-F.

source: Vim now completes the current word "sub" by looking at the files in the current directory.
es_es: Vim completará la palabra «sub» mirando en los ficheros en el directorio actual.

source: The first match is sub_count.c.
es_es: La primera coincidencia es «sub_count.c».

source: This is not the one you want, so you match the next file by typing CTRL-N.
es_es: Esto no es lo que buscaba, así que busca la siguiente pareja pulsando CTRL-N.

source: This match is sub_done.c.
es_es: La coincidencia es «sub_done.c».

source: Typing CTRL-N again takes you to sub_exit.c.
es_es: Teclear CTRL-N otra vez le devolvería a «sub_exit.c».

source: The results:
es_es: El resultado:

source: If the file name starts with / (Unix) or C:\ (MS-Windows) you can find all files in the file system.
es_es: Si el nombre de archivo empieza con «/» (Unix) o «C:\» (MS-Windows), puede buscar todos los archivos en el sistema de archivos.

source: For example, type "/u" and CTRL-X CTRL-F.
es_es: Por ejemplo, teclee «/u» y CTRL-X CTRL-F.

source: This will match "/usr" (this is on Unix):
es_es: Esto buscará «/usr» (en Unix):

source: If you now press CTRL-N you go back to "/u".
es_es: Si ahora pulsa CTRL-N volvería a «/u».

source: Instead, to accept the "/usr/" and go one directory level deeper, use CTRL-X CTRL-F again:
es_es: En lugar de ello, para aceptar «/usr/» y descender un nivel en el árbol de directorios, use otra vez CTRL-X CTRL-F:

source: The results depend on what is found in your file system, of course.
es_es: Los resultados varían según lo que se encuentra en su sistema de archivos.

source: The matches are sorted alphabetically.
es_es: Las coincidencias aparecen alfabéticamente.

source: Source code files are well structured.
es_es: Los archivos de código están bien estructurados.

source: That makes it possible to do completion in an intelligent way.
es_es: Esto posibilita un autocompletado inteligente.

source: In Vim this is called Omni completion.
es_es: En Vim, esto se llama autocompletado global («Omni completion»).

source: In some other editors it's called intellisense, but that is a trademark.
es_es: Algunos otros editores lo llaman intellisense, pero eso es una marca.

source: The key to Omni completion is CTRL-X CTRL-O.
es_es: La tecla para el autocompletado global es CTRL-X CTRL-O.

source: Obviously the O stands for Omni here, so that you can remember it easier.
es_es: Obviamente, la «O» significa «Omni», para recordarla mejor.

source: Let's use an example for editing C source:
es_es: Usemos un ejemplo para editar código C:

source: The cursor is after "p->".
es_es: El cursor está después de «p->».

source: Now type CTRL-X CTRL-O.
es_es: Pulse ahora CTRL-X CTRL-O.

source: Vim will offer you a list of alternatives, which are the items that "struct foo" contains.
es_es: Vim le ofrecerá una lista de alternativas, los cuales son los elementos que contiene «struct foo».

source: That is quite different from using CTRL-P, which would complete any word, while only members of "struct foo" are valid here.
es_es: Esto es diferente al uso de CTRL-P, el cual completa cualquier palabra, mientras que aquí sólo son válidos los miembros de «struct foo».

source: For Omni completion to work you may need to do some setup.
es_es: Necesita realizar alguna configuración para que funcione el autocompletado global.

source: At least make sure filetype plugins are enabled.
es_es: Asegúrese al menos de que las extensiones de tipo de archivo (filetype) están activadas.

source: Your vimrc file should contain a line like this: > filetype plugin on Or: > filetype plugin indent on
es_es: El archivo vimrc debería tener esta línea: > filetype plugin on O: > filetype plugin indent on

source: For C code you need to create a tags file and set the 'tags' option.
es_es: Necesita crear un archivo de etiquetas y definir la opción 'tags' si desea editar código C.

source: That is explained |ft-c-omni|.
es_es: Consulte |ft-c-omni|.

source: For other filetypes you may need to do something similar, look below |compl-omni-filetypes|.
es_es: Puede que tenga que realizar algo similar para otros tipos de archivo, consulte más adelante |compl-omni-filetypes|.

source: It only works for specific filetypes.
es_es: Sólo funciona para ciertos tipos de archivo.

source: Check the value of the 'omnifunc' option to find out if it would work.
es_es: Revise el valor de la opción 'omnifunc' para ver si funcionaría.

source: If you press CTRL-A, the editor inserts the text you typed the last time you were in Insert mode.
es_es: Si pulsa CTRL-A, el editor insertará el texto que tecleó la última que estaba en el modo Insertar.

source: Assume, for example, that you have a file that begins with the following:
es_es: Suponga, por ejemplo, que tiene un archivo que empieza con lo siguiente:

source: You go down to the beginning of the next line using the commands "j^".
es_es: Puede bajar hasta el inicio de la siguiente línea con las órdenes «j^».

source: You now start to insert a new "#include" line.
es_es: Ahora puede empezar a insertar una nueva línea «include».

source: So you type: >
es_es: Asi que escribe: >

source: The "#include " was inserted because CTRL-A inserts the text of the previous insert.
es_es: «#include» se insertó porque CTRL-A inserta el texto de la inserción anterior.

source: Now you type "main.h"<Enter> to finish the line:
es_es: Teclee ahora «main.h» <Enter> para finalizar la línea:

source: The CTRL-@ command does a CTRL-A and then exits Insert mode.
es_es: La orden CTRL-@ realiza un CTRL-A y abandona el modo Insertar.

source: That's a quick way of doing exactly the same insertion again.
es_es: Esta es una manera rápida de hacer la misma inserción otra vez.

source: The CTRL-Y command inserts the character above the cursor.
es_es: La orden CTRL-Y inserta el carácter sobre el cursor.

source: This is useful when you are duplicating a previous line.
es_es: Esto es útil si está duplicando una línea anterior.

source: For example, you have this line of C code:
es_es: Por ejemplo, tiene esta línea de código C:

source: Now you need to type the same line, but with "s_prev" instead of "s_next".
es_es: Ahora necesita escribir la misma línea, pero con un «s_prev» en lugar de «s_next».

source: Start the new line, and press CTRL-Y 14 times, until you are at the "n" of "next":
es_es: Inicie una nueva línea, y pulse CTRL-Y 14 veces, hasta encontrarse en la «n» de «next»:

source: The command CTRL-R {register} inserts the contents of the register.
es_es: La orden CTRL-R {registro} inserta el contenido de un registro.

source: This is useful to avoid having to type a long word.
es_es: Esto es útil para evitar escribir una palabra larga.

source: For example, you need to type this:
es_es: Por ejemplo, necesita teclear esto:

source: The function name is defined in a different file.
es_es: El nombre de la función se define en otro archivo.

source: Edit that file and move the cursor on top of the function name there, and yank it into register v: >
es_es: Edite ese archivo y desplace el cursor sobre el nombre de función presente, y copie el mismo al registro v:

source: "v is the register specification, "yiw" is yank-inner-word.
es_es: «"v» es el especificador del registro, «yiw» signifia copiar la palabra interior («yank inner word»).

source: Now edit the file where the new line is to be inserted, and type the first letters:
es_es: Edite ahora el archivo donde se insertará la línea, y escriba las primeras letras:

source: You continue to type the characters in between the function name, and use CTRL-R v two times more.
es_es: Continua insertando caracteres en medio del nombre de la función, y usa «CTRL-R v» dos veces más.

source: You could have done the same with completion.
es_es: Podría haber realizado lo mismo con el autocompletado.

source: Using a register is useful when there are many words that start with the same characters.
es_es: Usar un registro es útil cuando hay varias palabras que empiezan con el mismo carácter.

source: If the register contains characters such as <BS> or other special characters, they are interpreted as if they had been typed from the keyboard.
es_es: Si el registro contiene caracteres tales como <BS> o otros caracteres especiales, se interpretarán como introducidos a través del teclado.

source: If you do not want this to happen (you really want the <BS> to be inserted in the text), use the command CTRL-R CTRL-R {register}.
es_es: Si no desea que esto ocurra (realmente quiere que <BS> acabe insertado en el texto), use la orden CTRL-R CTRL-R {registro}.

source: An abbreviation is a short word that takes the place of a long one.
es_es: Una abreviatura es una palabra corta que sustituye a otra más larga.

source: For example, "ad" stands for "advertisement".
es_es: Por ejemplo, «poli» simboliza «policía».

source: Vim enables you to type an abbreviation and then will automatically expand it for you.
es_es: Vim le permite insertar una abreviatura para después expandirla automáticamente.

source: To tell Vim to expand "ad" into "advertisement" every time you insert it, use the following command: >
es_es: Para decir a Vim que expanda «poli» a «policía» cada vez que lo inserte, use la siguiente orden: >

source: Now, when you type "ad", the whole word "advertisement" will be inserted into the text.
es_es: Ahora, cuando escribe «po», aparecerá la palabra completa «policía» en el texto.

source: This is triggered by typing a character that can't be part of a word, for example a space:
es_es: Esto se activa cuando teclea un carácter que no puede ser parte de una palabra, como por ejemplo un espacio:

source: The expansion doesn't happen when typing just "ad".
es_es: La expansión no ocurre si solo escribe «po».

source: That allows you to type a word like "add", which will not get expanded.
es_es: Esto permite escribir una palabra como «polifacético», que no se expandirá.

source: Only whole words are checked for abbreviations.
es_es: Solo se revisan palabras completas con abreviaturas.

source: It is possible to define an abbreviation that results in multiple words.
es_es: Es posible definir una abreviatura cuyo resultado sean varias palabras.

source: For example, to define "JB" as "Jack Benny", use the following command: >
es_es: Por ejemplo, para definir «JB» como «Juan Benítez», use la siguiente orden: >

source: These are used for creating boxed comments.
es_es: Uso esto para crear comentarios en cajas.

source: The comment starts with #b, which draws the top line.
es_es: El comentario empieza con «#b», el cual escribe la línea superior.

source: I then type the comment text and use #e to draw the bottom line.
es_es: Después escribo el texto del comentario y uso «#e» para dibujar la línea inferior.

source: Notice that the #e abbreviation begins with a space.
es_es: Observe que la abreviatura «#e» empieza con un espacio.

source: In other words, the first two characters are space-star.
es_es: En otras palabras, los primeros dos caracteres son espacio-asterisco.

source: Usually Vim ignores spaces between the abbreviation and the expansion.
es_es: Por lo general, Vim ignora los espacios entre la abreviatura y la expansión.

source: To avoid that problem, I spell space as seven characters: <, S, p, a, c, e, >.
es_es: Para evitar tal problema, deletreo espacio («space») como siete caracters: <, S, p, a, c, e,>.

source: Note: ":iabbrev" is a long word to type.
es_es: Nota: La palabra «:iabbrev» es algo larga.

source: ":iab" works just as well.
es_es: «:iab» también daría resultado.

source: That's abbreviating the abbreviate command!
es_es: ¡Esto es abreviar la orden de abreviar!

source: It's very common to make the same typing mistake every time.
es_es: Es bastante normal escribir siempre el mismo error.

source: For example, typing "teh" instead of "the".
es_es: Por ejemplo, escribir «qeu» en lugar de «que».

source: You can fix this with an abbreviation: >
es_es: Puede arreglar esto con una abreviatura: >

source: You can add a whole list of these.
es_es: Puede crear una lista completa de ejemplos como este.

source: Add one each time you discover a common mistake.
es_es: Añada uno cada vez que descubra un error común.

source: :abbreviate i #e ****************************************/ i #b /**************************************** i JB Jack Benny i ad advertisement !
es_es: :abbreviate i #e ****************************************/ i #b /**************************************** i JB Juan Benítez i po policía !

source: teh the
es_es: qeu que

source: The "i" in the first column indicates Insert mode.
es_es: La «i» en la primera columna indica modo Insertar.

source: These abbreviations are only active in Insert mode.
es_es: Estas abreviaturas sólo están activas en el modo Insertar.

source: Other possible characters are:
es_es: Otros caracteres posibles son:

source: Since abbreviations are not often useful in Command-line mode, you will mostly use the ":iabbrev" command.
es_es: Debido a que las abreviaturas no son útiles en el modo Línea de órdenes, usará más regularmente la orden «:iabbrev».

source: That avoids, for example, that "ad" gets expanded when typing a command like: >
es_es: Esto evita, por ejemplo, que se expanda «po» al escribir una orden como: >

source: To get rid of an abbreviation, use the ":unabbreviate" command.
es_es: Para eliminar una abreviatura, use la orden «:unabbreviate».

source: Suppose you have the following abbreviation: >
es_es: Suponga que tiene la siguiente abreviatura: >

source: While you type this, you will notice that @f is expanded to "fresh".
es_es: Notará al escribir esto que @f se expande a «fresco».
